In [3]:
import numpy as np

arr1 = np.array([[4,2,1,7],[33,77,11,22]])
arr2 = np.array([[True, False, False, True],[False,False,True,True]])
arr1

array([[ 4,  2,  1,  7],
       [33, 77, 11, 22]])

In [4]:
arr2

array([[ True, False, False,  True],
       [False, False,  True,  True]])

In [5]:
arr1[arr2]

array([ 4,  7, 11, 22])

In [6]:
arr3 = np.array([False, True])
arr3

array([False,  True])

In [7]:
arr1[arr3]

array([[33, 77, 11, 22]])

In [9]:
arr4=[True,False,True, False]
arr4

[True, False, True, False]

In [11]:
arr1

array([[ 4,  2,  1,  7],
       [33, 77, 11, 22]])

In [10]:
arr1[:,arr4]

array([[ 4,  1],
       [33, 11]])

In [12]:
arr1 > 5

array([[False, False, False,  True],
       [ True,  True,  True,  True]])

In [13]:
arr1[arr1 > 5]

array([ 7, 33, 77, 11, 22])

In [41]:
np.random.seed(12345)
data = np.random.randn(7,4)
names = np.array(['bob', 'joe', 'will', 'bob', 'will', 'joe', 'joe'])
data

array([[-0.20470766,  0.47894334, -0.51943872, -0.5557303 ],
       [ 1.96578057,  1.39340583,  0.09290788,  0.28174615],
       [ 0.76902257,  1.24643474,  1.00718936, -1.29622111],
       [ 0.27499163,  0.22891288,  1.35291684,  0.88642934],
       [-2.00163731, -0.37184254,  1.66902531, -0.43856974],
       [-0.53974145,  0.47698501,  3.24894392, -1.02122752],
       [-0.5770873 ,  0.12412128,  0.30261356,  0.52377207]])

In [23]:
names

array(['bob', 'joe', 'will', 'bob', 'will', 'joe', 'joe'], dtype='<U4')

In [24]:
names == 'bob'

array([ True, False, False,  True, False, False, False])

In [25]:
data[names == 'bob'] #행 선택

array([[-0.20470766,  0.47894334, -0.51943872, -0.5557303 ],
       [ 0.27499163,  0.22891288,  1.35291684,  0.88642934]])

In [34]:
data[names == 'bob', 2:]

array([[-0.51943872, -0.5557303 ],
       [ 1.35291684,  0.88642934]])

In [46]:
data[ data<0 ] = 0
data

array([[0.        , 0.47894334, 0.        , 0.        ],
       [1.96578057, 1.39340583, 0.09290788, 0.28174615],
       [0.76902257, 1.24643474, 1.00718936, 0.        ],
       [0.27499163, 0.22891288, 1.35291684, 0.88642934],
       [0.        , 0.        , 1.66902531, 0.        ],
       [0.        , 0.47698501, 3.24894392, 0.        ],
       [0.        , 0.12412128, 0.30261356, 0.52377207]])

In [47]:
arr1 = np.arange(10)
arr1

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [49]:
np.exp(arr1)

array([1.00000000e+00, 2.71828183e+00, 7.38905610e+00, 2.00855369e+01,
       5.45981500e+01, 1.48413159e+02, 4.03428793e+02, 1.09663316e+03,
       2.98095799e+03, 8.10308393e+03])

In [51]:
np.sqrt(arr1)

array([0.        , 1.        , 1.41421356, 1.73205081, 2.        ,
       2.23606798, 2.44948974, 2.64575131, 2.82842712, 3.        ])

In [52]:
np.cos(arr1)

array([ 1.        ,  0.54030231, -0.41614684, -0.9899925 , -0.65364362,
        0.28366219,  0.96017029,  0.75390225, -0.14550003, -0.91113026])

In [53]:
np.sin(arr1)

array([ 0.        ,  0.84147098,  0.90929743,  0.14112001, -0.7568025 ,
       -0.95892427, -0.2794155 ,  0.6569866 ,  0.98935825,  0.41211849])

In [54]:
np.square(arr1)

array([ 0,  1,  4,  9, 16, 25, 36, 49, 64, 81])

In [56]:
arr2 = np.array([-4, 3, 1, -9, 12])
arr2

array([-4,  3,  1, -9, 12])

In [57]:
np.sign(arr2)

array([-1,  1,  1, -1,  1])

In [108]:
xarr = np.array([1.1, 1.2, 1.3, 1.4])
yarr = np.array([2.1, 2.2, 2.3, 2.4])
cond = np.array([True, False, True, True])

In [110]:
#result = [x if c else y for x, y, c in zip(xarr, yarr, cond)]
result = [x if c else y for x, y, c in zip(xarr, yarr, cond)]
result

[1.1, 2.2, 1.3, 1.4]

In [100]:
result2 = np.where(cond, xarr, yarr)
result2

array([1.1, 2.2, 1.3, 1.4])

In [96]:
np.random.seed(12345)
arr = np.random.randn(4,4)
arr

array([[-0.20470766,  0.47894334, -0.51943872, -0.5557303 ],
       [ 1.96578057,  1.39340583,  0.09290788,  0.28174615],
       [ 0.76902257,  1.24643474,  1.00718936, -1.29622111],
       [ 0.27499163,  0.22891288,  1.35291684,  0.88642934]])

In [97]:
np.where(arr >0, 2, -2)

array([[-2,  2, -2, -2],
       [ 2,  2,  2,  2],
       [ 2,  2,  2, -2],
       [ 2,  2,  2,  2]])

In [98]:
np.where(arr > 0, 2, arr)

array([[-0.20470766,  2.        , -0.51943872, -0.5557303 ],
       [ 2.        ,  2.        ,  2.        ,  2.        ],
       [ 2.        ,  2.        ,  2.        , -1.29622111],
       [ 2.        ,  2.        ,  2.        ,  2.        ]])

In [112]:
arr1 = np.arange(8)
arr1

array([0, 1, 2, 3, 4, 5, 6, 7])

In [115]:
arr2 = arr1.reshape(4,2)
arr2

array([[0, 1],
       [2, 3],
       [4, 5],
       [6, 7]])

In [116]:
arr2.T

array([[0, 2, 4, 6],
       [1, 3, 5, 7]])

In [117]:
np.random.seed(12345)

arr2 = np.random.randn(5,4)
arr2

array([[-0.20470766,  0.47894334, -0.51943872, -0.5557303 ],
       [ 1.96578057,  1.39340583,  0.09290788,  0.28174615],
       [ 0.76902257,  1.24643474,  1.00718936, -1.29622111],
       [ 0.27499163,  0.22891288,  1.35291684,  0.88642934],
       [-2.00163731, -0.37184254,  1.66902531, -0.43856974]])

In [120]:
arr2.mean(), arr2.sum()

(0.31297795308501103, 6.25955906170022)

In [121]:
arr2.mean(axis=0)

array([ 0.16068996,  0.59517085,  0.72052013, -0.22446913])

In [122]:
arr2.mean(axis=1)

array([-0.20023334,  0.93346011,  0.43160639,  0.68581267, -0.28575607])

In [123]:
arr2.sum(axis=0)

array([ 0.8034498 ,  2.97585425,  3.60260066, -1.12234566])

In [124]:
arr2.sum(axis=1)

array([-0.80093334,  3.73384044,  1.72642555,  2.74325069, -1.14302427])

In [125]:
arr2.std(axis=0)

array([1.30005078, 0.65484233, 0.81402236, 0.74760613])

In [129]:
arr3 = np.arange(8)
arr3

array([0, 1, 2, 3, 4, 5, 6, 7])

In [132]:
arr3.cumsum()

array([ 0,  1,  3,  6, 10, 15, 21, 28])

In [136]:
arr4 = np.array([[0,1,2],[3,4,5],[6,7,8]])
arr4

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [137]:
arr4.cumsum(axis=0)

array([[ 0,  1,  2],
       [ 3,  5,  7],
       [ 9, 12, 15]])

In [139]:
arr4.cumprod(axis=1)

array([[  0,   0,   0],
       [  3,  12,  60],
       [  6,  42, 336]])

In [140]:
arr1 = np.array([True, False, True, True])
arr1.sum()

3

In [144]:
bools = np.array([[False, False, True, False],[False, False, True, True]])
bools

array([[False, False,  True, False],
       [False, False,  True,  True]])

In [145]:
bools.all(axis=0)

array([False, False,  True, False])

In [146]:
bools.any(axis=0)

array([False, False,  True,  True])

In [154]:
np.random.seed(12345)
data = np.random.randn(10,3) *2
data

array([[-4.09415319e-01,  9.57886676e-01, -1.03887743e+00],
       [-1.11146061e+00,  3.93156115e+00,  2.78681167e+00],
       [ 1.85815753e-01,  5.63492306e-01,  1.53804514e+00],
       [ 2.49286947e+00,  2.01437872e+00, -2.59244222e+00],
       [ 5.49983267e-01,  4.57825758e-01,  2.70583367e+00],
       [ 1.77285868e+00, -4.00327462e+00, -7.43685074e-01],
       [ 3.33805062e+00, -8.77139472e-01, -1.07948289e+00],
       [ 9.53970021e-01,  6.49788784e+00, -2.04245505e+00],
       [-1.15417461e+00,  2.48242551e-01,  6.05227124e-01],
       [ 1.04754414e+00,  1.88055555e-03,  2.68761959e+00]])

In [163]:
data[ (data > 3).any(axis=1)]

array([[-1.11146061,  3.93156115,  2.78681167],
       [ 3.33805062, -0.87713947, -1.07948289],
       [ 0.95397002,  6.49788784, -2.04245505]])

In [156]:
data > 3

array([[False, False, False],
       [False,  True, False],
       [False, False, False],
       [False, False, False],
       [False, False, False],
       [False, False, False],
       [ True, False, False],
       [False,  True, False],
       [False, False, False],
       [False, False, False]])

In [162]:
data[ (data > 3).T.any(axis=0)]

array([[-1.11146061,  3.93156115,  2.78681167],
       [ 3.33805062, -0.87713947, -1.07948289],
       [ 0.95397002,  6.49788784, -2.04245505]])

In [171]:
data[0:1]

array([[-0.40941532,  0.95788668, -1.03887743]])

In [193]:
data[:,(data > 3).any(axis=0)]

array([[-4.09415319e-01,  9.57886676e-01],
       [-1.11146061e+00,  3.93156115e+00],
       [ 1.85815753e-01,  5.63492306e-01],
       [ 2.49286947e+00,  2.01437872e+00],
       [ 5.49983267e-01,  4.57825758e-01],
       [ 1.77285868e+00, -4.00327462e+00],
       [ 3.33805062e+00, -8.77139472e-01],
       [ 9.53970021e-01,  6.49788784e+00],
       [-1.15417461e+00,  2.48242551e-01],
       [ 1.04754414e+00,  1.88055555e-03]])

In [200]:
data[:,:2]

array([[-4.09415319e-01,  9.57886676e-01],
       [-1.11146061e+00,  3.93156115e+00],
       [ 1.85815753e-01,  5.63492306e-01],
       [ 2.49286947e+00,  2.01437872e+00],
       [ 5.49983267e-01,  4.57825758e-01],
       [ 1.77285868e+00, -4.00327462e+00],
       [ 3.33805062e+00, -8.77139472e-01],
       [ 9.53970021e-01,  6.49788784e+00],
       [-1.15417461e+00,  2.48242551e-01],
       [ 1.04754414e+00,  1.88055555e-03]])

array([5, 0, 1, 3, 2])

array([1, 2, 4, 3, 0])

In [184]:
np.random.seed(12345)
arr1 = np.random.randn(5,3)
arr1

array([[-0.20470766,  0.47894334, -0.51943872],
       [-0.5557303 ,  1.96578057,  1.39340583],
       [ 0.09290788,  0.28174615,  0.76902257],
       [ 1.24643474,  1.00718936, -1.29622111],
       [ 0.27499163,  0.22891288,  1.35291684]])

In [186]:
arr1.sort(axis=1)
arr1

array([[-0.51943872, -0.20470766,  0.47894334],
       [-0.5557303 ,  1.39340583,  1.96578057],
       [ 0.09290788,  0.28174615,  0.76902257],
       [-1.29622111,  1.00718936,  1.24643474],
       [ 0.22891288,  0.27499163,  1.35291684]])

In [187]:
arr1.sort(axis=0)
arr1

array([[-1.29622111, -0.20470766,  0.47894334],
       [-0.5557303 ,  0.27499163,  0.76902257],
       [-0.51943872,  0.28174615,  1.24643474],
       [ 0.09290788,  1.00718936,  1.35291684],
       [ 0.22891288,  1.39340583,  1.96578057]])

In [188]:
values = np.array([5,0,1,3,2])
indexer = values.argsort()
values

array([5, 0, 1, 3, 2])

In [189]:
indexer

array([1, 2, 4, 3, 0])

In [190]:
values[indexer]

array([0, 1, 2, 3, 5])

In [192]:
np.random.seed(12345)
arr=np.random.randn(3,5)
arr[0] = values
arr

array([[ 5.        ,  0.        ,  1.        ,  3.        ,  2.        ],
       [ 1.39340583,  0.09290788,  0.28174615,  0.76902257,  1.24643474],
       [ 1.00718936, -1.29622111,  0.27499163,  0.22891288,  1.35291684]])

In [201]:
arr[:, arr[0].argsort()]

array([[ 0.        ,  1.        ,  2.        ,  3.        ,  5.        ],
       [ 0.09290788,  0.28174615,  1.24643474,  0.76902257,  1.39340583],
       [-1.29622111,  0.27499163,  1.35291684,  0.22891288,  1.00718936]])

In [202]:
names

array(['bob', 'joe', 'will', 'bob', 'will', 'joe', 'joe'], dtype='<U4')

In [203]:
np.unique(names)

array(['bob', 'joe', 'will'], dtype='<U4')

In [204]:
arr1 = np.array([1,2,3,4])
arr2 = np.array([3,4,5,6])

In [211]:
np.union1d(arr1, arr2)

array([1, 2, 3, 4, 5, 6])

In [212]:
np.intersect1d(arr1, arr2)

array([3, 4])

In [213]:
np.setdiff1d(arr1, arr2)

array([1, 2])

In [218]:
x = np.array([[1,2,3],[4,5,6]])
y = np.array([[6.,23.],[-1,7],[8,9]])
x.dot(y)

array([[ 28.,  64.],
       [ 67., 181.]])

In [220]:
arr1 = np.array([10,20,30,40,50,60,70,80,90])
arr1

array([10, 20, 30, 40, 50, 60, 70, 80, 90])

In [221]:
np.random.shuffle(arr1)

In [222]:
arr1

array([10, 70, 20, 30, 90, 60, 80, 50, 40])

In [223]:
arr2 = np.array([10,20,30,40,50,60,70,80,90])
arr2

array([10, 20, 30, 40, 50, 60, 70, 80, 90])

In [224]:
np.random.permutation(arr2)

array([70, 50, 80, 20, 10, 40, 90, 30, 60])

In [225]:
arr2

array([10, 20, 30, 40, 50, 60, 70, 80, 90])

In [229]:
sindex = np.random.permutation(np.arange(10))

In [230]:
sindex

array([3, 8, 1, 7, 9, 6, 4, 2, 5, 0])

In [232]:
arr1 = np.arange(1,7).reshape(2,3)
arr2 = np.arange(7,13).reshape(2,3)
arr1

array([[1, 2, 3],
       [4, 5, 6]])

In [233]:
arr2

array([[ 7,  8,  9],
       [10, 11, 12]])

In [236]:
np.concatenate([arr1, arr2], axis=0)

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [10, 11, 12]])

In [237]:
np.concatenate([arr1, arr2], axis=1)

array([[ 1,  2,  3,  7,  8,  9],
       [ 4,  5,  6, 10, 11, 12]])

In [238]:
np.vstack([arr1, arr2])

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [10, 11, 12]])

In [239]:
np.hstack([arr1, arr2])

array([[ 1,  2,  3,  7,  8,  9],
       [ 4,  5,  6, 10, 11, 12]])

In [241]:
arr3 = np.arange(6)
arr4 = np.arange(6).reshape(3,2)
arr5 = np.random.randn(3,2)
arr3

array([0, 1, 2, 3, 4, 5])

In [242]:
arr4

array([[0, 1],
       [2, 3],
       [4, 5]])

In [243]:
arr5

array([[ 0.88642934, -0.71354399],
       [-0.83115354, -2.37023165],
       [-1.86076079, -0.8607574 ]])

In [245]:
np.r_[arr4, arr5]

array([[ 0.        ,  1.        ],
       [ 2.        ,  3.        ],
       [ 4.        ,  5.        ],
       [ 0.88642934, -0.71354399],
       [-0.83115354, -2.37023165],
       [-1.86076079, -0.8607574 ]])

In [246]:
np.c_[np.r_[arr4, arr5], arr3]

array([[ 0.        ,  1.        ,  0.        ],
       [ 2.        ,  3.        ,  1.        ],
       [ 4.        ,  5.        ,  2.        ],
       [ 0.88642934, -0.71354399,  3.        ],
       [-0.83115354, -2.37023165,  4.        ],
       [-1.86076079, -0.8607574 ,  5.        ]])

In [250]:
import pandas as pd
sdata1 = pd.Series([1.7, 05.3])
sdata1, type(sdata1)

(0    1.7
 1    5.3
 dtype: float64,
 pandas.core.series.Series)

In [251]:
sdata1 = pd.Series([4,7,-5,3], index = ['a', 'b', 'a', 'c'])
sdata1

a    4
b    7
a   -5
c    3
dtype: int64

In [252]:
sdata1['b']

7

In [255]:
sdata1[['c','b']]

c    3
b    7
dtype: int64

In [256]:
np.exp(sdata1)

a      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [257]:
sdata1

a    4
b    7
a   -5
c    3
dtype: int64

In [258]:
sdata1 * 3

a    12
b    21
a   -15
c     9
dtype: int64

In [260]:
sdata1 > 0

a     True
b     True
a    False
c     True
dtype: bool

In [261]:
sdata1[['a']]

a    4
a   -5
dtype: int64

In [265]:
sdata1[sdata1>3]

a    4
b    7
dtype: int64

In [266]:
sdata1.index

Index(['a', 'b', 'a', 'c'], dtype='object')

In [267]:
sdata1.values

array([ 4,  7, -5,  3])

In [271]:
ddata1 = {'seoul':1000, 'busan': 2000, 'inchun': 3000, 'daegu': 4000}
ddata1

{'seoul': 1000, 'busan': 2000, 'inchun': 3000, 'daegu': 4000}

In [272]:
sdata2= pd.Series(ddata1)
sdata2

seoul     1000
busan     2000
inchun    3000
daegu     4000
dtype: int64

In [275]:
frame1 = pd.DataFrame([[1,3,4],[6,7,8]])
frame1

   0  1  2
0  1  3  4
1  6  7  8

In [286]:
frame1 = pd.DataFrame([[1,3,4],[6,7,8]], index=['one', 'two'], columns=[1,2,3])
frame1

     1  2  3
one  1  3  4
two  6  7  8

In [282]:
ldata = [{'kim': 'seoul'},{'lee': 'busan'},{'jung': 'suwon'}]
frame2 = pd.DataFrame(ldata, columns=['name', 'address'])
frame2

   name  address
0   NaN      NaN
1   NaN      NaN
2   NaN      NaN

In [293]:
ddata = {'state': ['a', 'b', 'c', 'd'],
         'year': [2010,2011,2012,2013],
         'pop': [1.5, 1.6, 1.7, 1.8]}
frame3 = pd.DataFrame(ddata)
frame3

  state  year  pop
0     a  2010  1.5
1     b  2011  1.6
2     c  2012  1.7
3     d  2013  1.8

In [303]:
frame4 = pd.DataFrame(ddata, columns=['state', 'pop', 'year'], index=['one', 'two', 'three', 'four'])
frame4

      state  pop  year
one       a  1.5  2010
two       b  1.6  2011
three     c  1.7  2012
four      d  1.8  2013

In [304]:
frame4['state']

one      a
two      b
three    c
four     d
Name: state, dtype: object

In [305]:
frame4.state

one      a
two      b
three    c
four     d
Name: state, dtype: object

In [306]:
frame4.loc['three']

state       c
pop       1.7
year     2012
Name: three, dtype: object

In [309]:
frame4.loc['three','year']

2012

In [310]:
frame4

      state  pop  year
one       a  1.5  2010
two       b  1.6  2011
three     c  1.7  2012
four      d  1.8  2013

In [312]:
frame4.index.name = 'id'
frame4.columns.name = 'info'
frame4

info  state  pop  year
id
one       a  1.5  2010
two       b  1.6  2011
three     c  1.7  2012
four      d  1.8  2013

In [316]:
frame4['area'] = pd.Series([100,200,300,400],index=['one', 'two', 'three', 'four'])
frame4

info  state  pop  year  area
id
one       a  1.5  2010   100
two       b  1.6  2011   200
three     c  1.7  2012   300
four      d  1.8  2013   400

In [319]:
frame4.loc['five'] = pd.Series(['e', 1.9, 2014, 500], 
                               index=['state', 'pop', 'year', 'area'])
frame4

info  state  pop  year  area
id
one       a  1.5  2010   100
two       b  1.6  2011   200
three     c  1.7  2012   300
four      d  1.8  2013   400
five      e  1.9  2014   500

In [320]:
sdata1 = pd.Series([4,1,5,3], index=list('dabc'))
sdata1

d    4
a    1
b    5
c    3
dtype: int64

In [322]:
sdata2 = sdata1.reindex(['a', 'b', 'c', 'd', 'e'])
sdata2

a    1.0
b    5.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [323]:
sdata3 = pd.Series(['red', 'blue', 'green'], index = [0,2,4])
sdata3

0      red
2     blue
4    green
dtype: object

In [328]:
sdata3.reindex(np.arange(6), method='ffill')

0      red
1      red
2     blue
3     blue
4    green
5    green
dtype: object

In [329]:
frame1 = pd.DataFrame(np.arange(9).reshape(3,3), 
                      index=list('acd'), columns=['one', 'two', 'three'])
frame1

   one  two  three
a    0    1      2
c    3    4      5
d    6    7      8

In [332]:
frame1.reindex(list('abcd'), method='ffill')

   one  two  three
a    0    1      2
b    0    1      2
c    3    4      5
d    6    7      8

In [333]:
frame1.reindex(columns=['one', 'two', 'three', 'four'])

   one  two  three  four
a    0    1      2   NaN
c    3    4      5   NaN
d    6    7      8   NaN

In [334]:
sdata1 = pd.Series(np.arange(5), index=list('abcde'))
sdata1

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [335]:
sdata1.drop('c')

a    0
b    1
d    3
e    4
dtype: int64

In [336]:
sdata1

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [337]:
sdata1.drop('b', inplace=True)

In [338]:
sdata1

a    0
c    2
d    3
e    4
dtype: int64

In [339]:
frame1 = pd.DataFrame(np.arange(16).reshape(4,4),
                     index=list('abcd'),
                     columns=['one', 'two', 'three', 'four'])
frame1

   one  two  three  four
a    0    1      2     3
b    4    5      6     7
c    8    9     10    11
d   12   13     14    15

In [340]:
frame1.drop('a')

   one  two  three  four
b    4    5      6     7
c    8    9     10    11
d   12   13     14    15

In [345]:
frame1.drop(['two', 'four'], axis = 1)
frame1.drop(['two', 'four'], axis = 'columns')

   one  three
a    0      2
b    4      6
c    8     10
d   12     14

In [346]:
sdata3 = pd.Series([4,2,7,9,1], index = list('abcde'))
sdata3

a    4
b    2
c    7
d    9
e    1
dtype: int64

In [351]:
sdata3['b'], sdata3[1]

(2, 2)

In [352]:
sdata3[1:4]

b    2
c    7
d    9
dtype: int64

In [353]:
sdata3['b':'e']

b    2
c    7
d    9
e    1
dtype: int64

In [362]:
frame3 = pd.DataFrame(np.arange(16).reshape(4,4),
                     index = ['ohio', 'colorado', 'utah', 'new york'],
                     columns=['one','two','three','four'])
frame3

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [366]:
frame3.iloc[1,1]

5

In [368]:
frame3.iloc[1:, 2:4]

          three  four
colorado      6     7
utah         10    11
new york     14    15

In [370]:
frame3.loc['colorado':, 'three':'four']

          three  four
colorado      6     7
utah         10    11
new york     14    15

In [374]:
frame1 = pd.DataFrame(np.arange(12).reshape(3,4), columns=list('abcd'))
frame2 = pd.DataFrame(np.arange(20).reshape(4,5), columns=list('abcde'))
frame1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [375]:
frame2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [376]:
frame1+frame2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [377]:
frame1.add(frame2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [378]:
frame3 = pd.DataFrame(np.arange(12).reshape(4,3),
                     columns=list('bde'),
                     index=['one', 'two', 'three', 'four'])
frame3

       b   d   e
one    0   1   2
two    3   4   5
three  6   7   8
four   9  10  11

In [380]:
sdata = frame3.iloc[0]
sdata

b    0
d    1
e    2
Name: one, dtype: int64

In [381]:
frame3 - sdata

       b  d  e
one    0  0  0
two    3  3  3
three  6  6  6
four   9  9  9

In [382]:
sdata - frame3

       b  d  e
one    0  0  0
two   -3 -3 -3
three -6 -6 -6
four  -9 -9 -9

In [383]:
sdata2 = frame3.d
sdata2

one       1
two       4
three     7
four     10
Name: d, dtype: int64

In [388]:
frame3.sub(sdata2, axis='index')

       b  d  e
one   -1  0  1
two   -1  0  1
three -1  0  1
four  -1  0  1

In [386]:
frame3.add(sdata2, axis='index')

        b   d   e
one     1   2   3
two     7   8   9
three  13  14  15
four   19  20  21

In [390]:
np.random.seed(12345)
frame1 = pd.DataFrame(np.random.randn(4,3),
                     columns=list('bde'),
                     index=['seoul', 'busan', 'inchen', 'daegu'])
frame1

               b         d         e
seoul  -0.204708  0.478943 -0.519439
busan  -0.555730  1.965781  1.393406
inchen  0.092908  0.281746  0.769023
daegu   1.246435  1.007189 -1.296221

In [394]:
f1 = lambda x : x.max() - x.min()
frame1.apply(f1, axis=0)

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [399]:
frame1['b'].max(), frame1['b'].min()

(1.2464347363862822, -0.55573030434749)

In [402]:
def f2(x):
    return pd.Series([x.min(), x.min()])

frame1.apply(f2, axis=0)

         b         d         e
0 -0.55573  0.281746 -1.296221
1 -0.55573  0.281746 -1.296221

In [421]:
f1 = lambda x : pd.Series([x.min(), x.min()])
frame1.apply(f1, axis=0)

         b         d         e
0 -0.55573  0.281746 -1.296221
1 -0.55573  0.281746 -1.296221

In [405]:
frame1

               b         d         e
seoul  -0.204708  0.478943 -0.519439
busan  -0.555730  1.965781  1.393406
inchen  0.092908  0.281746  0.769023
daegu   1.246435  1.007189 -1.296221

In [417]:
#f3 = lambda x: '%.2f' %x
#f3 = lambda x: '{0:0.2f}'.format(x)
f3 = lambda x: f'{x:0.2f}'

frame2 = frame1.applymap(f3)
frame2

            b     d      e
seoul   -0.20  0.48  -0.52
busan   -0.56  1.97   1.39
inchen   0.09  0.28   0.77
daegu    1.25  1.01  -1.30

In [409]:
frame1['b'].map(f3)

seoul     -0.20
busan     -0.56
inchen     0.09
daegu      1.25
Name: b, dtype: object

In [410]:
frame1['b'].apply(f3)

seoul     -0.20
busan     -0.56
inchen     0.09
daegu      1.25
Name: b, dtype: object

In [422]:
np.random.seed(12345)
frame = pd.DataFrame(np.random.randn(1000,3), columns=['first', 'second', 'third'])
frame

        first    second     third
0   -0.204708  0.478943 -0.519439
1   -0.555730  1.965781  1.393406
2    0.092908  0.281746  0.769023
3    1.246435  1.007189 -1.296221
4    0.274992  0.228913  1.352917
..        ...       ...       ...
995  0.114029 -0.870229 -0.044685
996 -0.586679  0.629777  0.805876
997 -0.556207  0.020182 -0.586615
998 -1.360064  0.813568  0.488321
999  0.395433  0.766159  1.999486

[1000 rows x 3 columns]

In [423]:
frame.sum(axis=1)

0     -0.245203
1      2.803456
2      1.143677
3      0.957403
4      1.856821
         ...
995   -0.800885
996    0.848974
997   -1.122640
998   -0.058175
999    3.161078
Length: 1000, dtype: float64

In [426]:
frame.mean(axis=0)

first     0.018519
second    0.016818
third    -0.013594
dtype: float64

In [427]:
frame.describe()

             first       second        third
count  1000.000000  1000.000000  1000.000000
mean      0.018519     0.016818    -0.013594
std       1.009211     0.999221     0.995732
min      -3.184377    -3.745356    -3.399312
25%      -0.677474    -0.671086    -0.674012
50%       0.013308    -0.013236    -0.040781
75%       0.704911     0.655233     0.662744
max       2.954439     3.927528     3.260383

In [428]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   first   1000 non-null   float64
 1   second  1000 non-null   float64
 2   third   1000 non-null   float64
dtypes: float64(3)
memory usage: 23.6 KB

In [429]:
frame.head(10)

      first    second     third
0 -0.204708  0.478943 -0.519439
1 -0.555730  1.965781  1.393406
2  0.092908  0.281746  0.769023
3  1.246435  1.007189 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741
7  0.476985  3.248944 -1.021228
8 -0.577087  0.124121  0.302614
9  0.523772  0.000940  1.343810

In [430]:
frame.tail(15)

        first    second     third
985 -1.125330  0.492759 -0.688164
986  1.024083  1.568407  0.074709
987 -1.203249  0.852469  0.594474
988 -1.019692 -0.174759  0.446165
989 -0.203532  0.759681  1.848884
990  0.493904  0.098768  0.989035
991  0.718557  0.598281 -1.417096
992  2.505056 -0.343931 -0.446398
993  0.325000 -1.270664  1.675919
994  1.888946  0.887686 -1.171628
995  0.114029 -0.870229 -0.044685
996 -0.586679  0.629777  0.805876
997 -0.556207  0.020182 -0.586615
998 -1.360064  0.813568  0.488321
999  0.395433  0.766159  1.999486